           05  F1-Name                pic x(100).
           05  F1-Emaiyl-Address       pic x(32).
           05  F13-DNC                 pic x.
           05  F13-DNC                 pic x.